Ran Plan for dir: `.` workspace: `area13`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # digitalocean_droplet.forem has changed
~ resource "digitalocean_droplet" "forem" {
        id                   = "255862486"
      ~ name                 = "www.evilfactorylabs.org" -> "evilfactorylabs.org"
        tags                 = []
        # (21 unchanged attributes hidden)
    }

  # linode_domain.evilfactorylabs_social has been deleted
- resource "linode_domain" "evilfactorylabs_social" {
      - id          = "1922199" -> null
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # linode_instance.evilfactorylabs_social has been deleted
- resource "linode_instance" "evilfactorylabs_social" {
      - id                = "40269786" -> null
      - ip_address        = "192.53.114.48" -> null
      - label             = "evilfactorylabs.social" -> null
        tags              = []
        # (14 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # digitalocean_domain.evilfactorylabs_social will be created
+ resource "digitalocean_domain" "evilfactorylabs_social" {
      + id   = (known after apply)
      + name = "evilfactorylabs.social"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # digitalocean_droplet.forem will be updated in-place
~ resource "digitalocean_droplet" "forem" {
      + graceful_shutdown    = false
        id                   = "255862486"
      ~ name                 = "evilfactorylabs.org" -> "www.evilfactorylabs.org"
        tags                 = []
        # (21 unchanged attributes hidden)
    }

  # digitalocean_firewall.forem will be updated in-place
~ resource "digitalocean_firewall" "forem" {
        id              = "cdaa6351-3e24-481d-984a-d58383c13f2a"
        name            = "www.evilfactorylabs.org"
        tags            = []
        # (4 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "25565" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - source_droplet_ids        = [] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }

      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "tcp" -> null
        }
      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "udp" -> null
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }

        # (5 unchanged blocks hidden)
    }

  # linode_domain.evilfactorylabs_social will be created
+ resource "linode_domain" "evilfactorylabs_social" {
      + domain    = "evilfactorylabs.social"
      + id        = (known after apply)
      + soa_email = "hostmaster@evilfactorylabs.org"
      + status    = (known after apply)
      + type      = "master"
    }

  # linode_domain_record.evilfactorylabs_social_apex will be created
+ resource "linode_domain_record" "evilfactorylabs_social_apex" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + record_type = "A"
      + target      = (known after apply)
    }

  # linode_domain_record.evilfactorylabs_social_mailgun_cname will be created
+ resource "linode_domain_record" "evilfactorylabs_social_mailgun_cname" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "email.mg"
      + record_type = "CNAME"
      + target      = "eu.mailgun.org"
    }

  # linode_domain_record.evilfactorylabs_social_mailgun_dkim will be created
+ resource "linode_domain_record" "evilfactorylabs_social_mailgun_dkim" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "mta._domainkey.mg"
      + record_type = "TXT"
      + target      = "k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCrPKiwLlHzORW+15yUzFqA3qaVqs8oCmz69hNOaEx5sAnxpP7GpVvapEB/Bt2LNb1memDHcNfwwc7aUYI7YYUAQtPB8Tmfy1p91skVIdeNpJ3TM8qemKmZ3JIeO/JztzOIwwUjUY8dg7OuoP9zJAK/JU6lcbpdDBHUpSVEYqBsKQIDAQAB"
    }

  # linode_domain_record.evilfactorylabs_social_mailgun_mx["0"] will be created
+ resource "linode_domain_record" "evilfactorylabs_social_mailgun_mx" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "mxa.eu.mailgun.org"
      + priority    = 10
      + record_type = "MX"
      + target      = "mg.evilfactorylabs.social"
    }

  # linode_domain_record.evilfactorylabs_social_mailgun_mx["1"] will be created
+ resource "linode_domain_record" "evilfactorylabs_social_mailgun_mx" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "mxb.eu.mailgun.org"
      + priority    = 10
      + record_type = "MX"
      + target      = "mg.evilfactorylabs.social"
    }

  # linode_domain_record.evilfactorylabs_social_mailgun_spf will be created
+ resource "linode_domain_record" "evilfactorylabs_social_mailgun_spf" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "mg"
      + record_type = "TXT"
      + target      = "v=spf1 include:mailgun.org ~all"
    }

  # linode_domain_record.evilfactorylabs_social_s3 will be created
+ resource "linode_domain_record" "evilfactorylabs_social_s3" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "s3"
      + record_type = "A"
      + target      = (known after apply)
    }

  # linode_firewall.evilfactorylabs_social will be created
+ resource "linode_firewall" "evilfactorylabs_social" {
      + devices         = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + inbound_policy  = "ACCEPT"
      + label           = "evilfactorylabs.social"
      + linodes         = (known after apply)
      + outbound_policy = "ACCEPT"
      + status          = (known after apply)

      + inbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "100.64.0.0/10",
            ]
          + ipv6     = []
          + label    = "accept-inbound-SSH"
          + ports    = "22"
          + protocol = "TCP"
        }
      + inbound {
          + action   = "DROP"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "drop-inbound-SSH"
          + ports    = "22"
          + protocol = "TCP"
        }
      + inbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "accept-inbound-HTTP"
          + ports    = "80"
          + protocol = "TCP"
        }
      + inbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "accept-inbound-HTTPS"
          + ports    = "443"
          + protocol = "TCP"
        }
    }

  # linode_instance.evilfactorylabs_social will be created
+ resource "linode_instance" "evilfactorylabs_social" {
      + backups            = (known after apply)
      + backups_enabled    = (known after apply)
      + boot_config_label  = (known after apply)
      + booted             = (known after apply)
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "evilfactorylabs.social"
      + private_ip_address = (known after apply)
      + region             = "ap-south"
      + resize_disk        = false
      + shared_ipv4        = (known after apply)
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + type               = "g6-standard-1"
      + watchdog_enabled   = true

      + config {
          + kernel      = "linode/grub2"
          + label       = "My Rocky Linux 9 Disk Profile"
          + root_device = "/dev/sda"
          + run_level   = "default"
          + virt_mode   = "paravirt"

          + devices {
              + sda {
                  + disk_id    = (known after apply)
                  + disk_label = "Rocky Linux 9 Disk"
                }
              + sdb {
                  + disk_id    = (known after apply)
                  + disk_label = "512 MB Swap Image"
                }
            }
        }

      + disk {
          + filesystem       = (known after apply)
          + id               = (known after apply)
          + image            = (known after apply)
          + label            = "Rocky Linux 9 Disk"
          + read_only        = (known after apply)
          + size             = 50688
          + stackscript_data = (sensitive value)
          + stackscript_id   = (known after apply)
        }
      + disk {
          + filesystem       = (known after apply)
          + id               = (known after apply)
          + image            = (known after apply)
          + label            = "512 MB Swap Image"
          + read_only        = (known after apply)
          + size             = 512
          + stackscript_data = (sensitive value)
          + stackscript_id   = (known after apply)
        }
    }

Plan: 11 to add, 2 to change, 0 to destroy.

Changes to Outputs:
~ evilfactorylabs_social_ip      = "192.53.114.48" -> (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w area13`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.evilfactorylabs.org/lock?id=evilfactorylabs%252Farea13%252F.%252Farea13)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w area13`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 11 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
